In [ ]:
import pandas as pd

In [ ]:
df = pd.read_excel('./Datasets/Salaries.xlsx')

In [3]:
#List the first 5 records
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [4]:
#list the last 5 records
df.tail()

         rank discipline  phd  service     sex  salary
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646
78       Prof          A   23       15  Female  109646

In [5]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [6]:
df['salary'].dtype

dtype('int64')

In [7]:
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [8]:
#Number of dimensions
df.ndim

2

In [9]:
#Number of elements
df.size

474

In [10]:
#Shape attribute
df.shape

(79, 6)

In [11]:
78*6

468

In [12]:
#Number of rows
df.shape[0]

79

In [13]:
#Number of Columns
df.shape[1]

6

In [14]:
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [15]:
#Descriptive statistics for numeric columns
df.describe()

             phd    service         salary
count  79.000000  79.000000      79.000000
mean   19.746835  15.050633  108044.316456
std    12.423580  12.061699   28112.298805
min     1.000000   0.000000   57800.000000
25%    10.500000   5.500000   89225.000000
50%    19.000000  15.000000  104800.000000
75%    27.500000  20.500000  126616.500000
max    56.000000  51.000000  186960.000000

In [16]:
df[['phd', 'service', 'salary']].max()

phd            56
service        51
salary     186960
dtype: int64

In [17]:
#Mean of the first 50 records
df.head(50).mean()

C:\Users\CLASSROOM\AppData\Local\Temp\ipykernel_1580\575988496.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.head(50).mean()

phd            21.52
service        17.60
salary     113789.14
dtype: float64

In [18]:
#Basic Statistics for the salary column
df['salary'].describe()

count        79.000000
mean     108044.316456
std       28112.298805
min       57800.000000
25%       89225.000000
50%      104800.000000
75%      126616.500000
max      186960.000000
Name: salary, dtype: float64

In [19]:
#how many values in the salary column (use count method);
df['salary'].count()

79

In [20]:
#Mean Salary
df['salary'].mean()

108044.3164556962

In [21]:
df_rank= df.groupby(['rank'], sort = 'False')
df_rank.mean()

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       26.978723  21.276596  123327.382979

In [22]:
df.describe()

             phd    service         salary
count  79.000000  79.000000      79.000000
mean   19.746835  15.050633  108044.316456
std    12.423580  12.061699   28112.298805
min     1.000000   0.000000   57800.000000
25%    10.500000   5.500000   89225.000000
50%    19.000000  15.000000  104800.000000
75%    27.500000  20.500000  126616.500000
max    56.000000  51.000000  186960.000000

In [23]:
df.isnull().sum()

rank          0
discipline    0
phd           0
service       0
sex           0
salary        0
dtype: int64

In [24]:
df.drop_duplicates(inplace = True)

In [25]:
df.shape

(78, 6)

In [26]:
df.to_excel('Salaries-PreProcessed.xlsx')